Revit 2024 API
Zone.Spaces Property
Get the Spaces of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public SpaceSet Spaces { get; }
Visual Basic
Public ReadOnly Property Spaces As SpaceSet
	Get
Visual C++
public:
property SpaceSet^ Spaces {
	SpaceSet^ get ();
}
Remarks
This property is used to get the Spaces of the Zone.
See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace